tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18855_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF18855_H_
#define _PIC16LF18855_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define RA6                           35
#define RA7                           36
#define PORTB                         37
#define RB0                           38
#define RB1                           39
#define RB2                           40
#define RB3                           41
#define RB4                           42
#define RB5                           43
#define RB6                           44
#define RB7                           45
#define PORTC                         46
#define RC0                           47
#define RC1                           48
#define RC2                           49
#define RC3                           50
#define RC4                           51
#define RC5                           52
#define RC6                           53
#define RC7                           54
#define PORTE                         55
#define RE3                           56
#define TRISA                         57
#define TRISA0                        58
#define TRISA1                        59
#define TRISA2                        60
#define TRISA3                        61
#define TRISA4                        62
#define TRISA5                        63
#define TRISA6                        64
#define TRISA7                        65
#define TRISB                         66
#define TRISB0                        67
#define TRISB1                        68
#define TRISB2                        69
#define TRISB3                        70
#define TRISB4                        71
#define TRISB5                        72
#define TRISB6                        73
#define TRISB7                        74
#define TRISC                         75
#define TRISC0                        76
#define TRISC1                        77
#define TRISC2                        78
#define TRISC3                        79
#define TRISC4                        80
#define TRISC5                        81
#define TRISC6                        82
#define TRISC7                        83
#define LATA                          84
#define LATA0                         85
#define LATA1                         86
#define LATA2                         87
#define LATA3                         88
#define LATA4                         89
#define LATA5                         90
#define LATA6                         91
#define LATA7                         92
#define LATB                          93
#define LATB0                         94
#define LATB1                         95
#define LATB2                         96
#define LATB3                         97
#define LATB4                         98
#define LATB5                         99
#define LATB6                         100
#define LATB7                         101
#define LATC                          102
#define LATC0                         103
#define LATC1                         104
#define LATC2                         105
#define LATC3                         106
#define LATC4                         107
#define LATC5                         108
#define LATC6                         109
#define LATC7                         110
#define TMR0L0                        111
#define TMR0L                         112
#define TMR0L1                        113
#define TMR0L2                        114
#define TMR0L3                        115
#define TMR0L4                        116
#define TMR0L5                        117
#define TMR0L6                        118
#define TMR0L7                        119
#define TMR0H0                        120
#define T0PR                          121
#define TMR0H                         122
#define T0PR0                         123
#define TMR0H1                        124
#define T0PR1                         125
#define TMR0H2                        126
#define T0PR2                         127
#define TMR0H3                        128
#define T0PR3                         129
#define TMR0H4                        130
#define T0PR4                         131
#define TMR0H5                        132
#define T0PR5                         133
#define TMR0H6                        134
#define T0PR6                         135
#define TMR0H7                        136
#define T0PR7                         137
#define T0CON0                        138
#define T0OUTPS                       139
#define T0OUTPS0                      140
#define T0OUTPS1                      141
#define T0OUTPS2                      142
#define T0OUTPS3                      143
#define T016BIT                       144
#define T0OUT                         145
#define T0EN                          146
#define T0CON1                        147
#define T0PS                          148
#define T0CKPS                        149
#define T0CKPS0                       150
#define T0PS0                         151
#define T0CKPS1                       152
#define T0PS1                         153
#define T0CKPS2                       154
#define T0PS2                         155
#define T0CKPS3                       156
#define T0PS3                         157
#define T0ASYNC                       158
#define T0CS                          159
#define T0CS0                         160
#define T0CS1                         161
#define T0CS2                         162
#define ADRESL                        163
#define ADPREVL                       164
#define ADPREV0                       165
#define ADPREV1                       166
#define ADPREV2                       167
#define ADPREV3                       168
#define ADPREV4                       169
#define ADPREV5                       170
#define ADPREV6                       171
#define ADPREV7                       172
#define ADPREVH                       173
#define ADPREV8                       174
#define ADPREV9                       175
#define ADPREV10                      176
#define ADPREV11                      177
#define ADPREV12                      178
#define ADPREV13                      179
#define ADPREV14                      180
#define ADPREV15                      181
#define ADACC0                        182
#define ADACCL                        183
#define ADACC1                        184
#define ADACC2                        185
#define ADACC3                        186
#define ADACC4                        187
#define ADACC5                        188
#define ADACC6                        189
#define ADACC7                        190
#define ADACC8                        191
#define ADACCH                        192
#define ADACC9                        193
#define ADACC10                       194
#define ADACC11                       195
#define ADACC12                       196
#define ADACC13                       197
#define ADACC14                       198
#define ADACC15                       199
#define ADCON0                        200
#define nDONE                         201
#define DONE                          202
#define GO                            203
#define GO_nDONE                      204
#define ADGO                          205
#define ADFM                          206
#define ADFM0                         207
#define ADFM1                         208
#define ADCS                          209
#define ADCONT                        210
#define ADON                          211
#define ADCON1                        212
#define ADDSEN                        213
#define ADGPOL                        214
#define ADIPEN                        215
#define ADPPOL                        216
#define ADCON2                        217
#define ADMD                          218
#define ADMD0                         219
#define ADMD1                         220
#define ADMD2                         221
#define ADACLR                        222
#define ADCRS                         223
#define ADCRS0                        224
#define ADCRS1                        225
#define ADCRS2                        226
#define ADPSIS                        227
#define ADCON3                        228
#define ADTMD                         229
#define ADTMD0                        230
#define ADTMD1                        231
#define ADTMD2                        232
#define ADSOI                         233
#define ADCALC                        234
#define ADCALC0                       235
#define ADCALC1                       236
#define ADCALC2                       237
#define ADSTAT                        238
#define ADSTAT0                       239
#define ADSTAT1                       240
#define ADSTAT2                       241
#define ADMACT                        242
#define ADMATH                        243
#define ADLTHR                        244
#define ADUTHR                        245
#define ADAOV                         246
#define ADCLK                         247
#define ADCCS0                        248
#define ADCCS                         249
#define ADCCS1                        250
#define ADCCS2                        251
#define ADCCS3                        252
#define ADCCS4                        253
#define ADCCS5                        254
#define ADACT0                        255
#define ADACT                         256
#define ADACT1                        257
#define ADACT2                        258
#define ADACT3                        259
#define ADACT4                        260
#define ADREF                         261
#define ADPREF                        262
#define ADPREF0                       263
#define ADPREF1                       264
#define ADNREF                        265
#define ADCAP                         266
#define ADCAP0                        267
#define ADCAP1                        268
#define ADCAP2                        269
#define ADCAP3                        270
#define ADCAP4                        271
#define ADPRE0                        272
#define ADPRE                         273
#define ADPRE1                        274
#define ADPRE2                        275
#define ADPRE3                        276
#define ADPRE4                        277
#define ADPRE5                        278
#define ADPRE6                        279
#define ADPRE7                        280
#define ADACQ                         281
#define ADACQ0                        282
#define ADACQ1                        283
#define ADACQ2                        284
#define ADACQ3                        285
#define ADACQ4                        286
#define ADACQ5                        287
#define ADACQ6                        288
#define ADACQ7                        289
#define ADPCH                         290
#define ADPCH0                        291
#define ADPCH1                        292
#define ADPCH2                        293
#define ADPCH3                        294
#define ADPCH4                        295
#define ADPCH5                        296
#define ADCNT0                        297
#define ADCNT                         298
#define ADCNT1                        299
#define ADCNT2                        300
#define ADCNT3                        301
#define ADCNT4                        302
#define ADCNT5                        303
#define ADCNT6                        304
#define ADCNT7                        305
#define ADRPT0                        306
#define ADRPT                         307
#define ADRPT1                        308
#define ADRPT2                        309
#define ADRPT3                        310
#define ADRPT4                        311
#define ADRPT5                        312
#define ADRPT6                        313
#define ADRPT7                        314
#define ADLTH0                        315
#define ADLTHL                        316
#define ADLTH1                        317
#define ADLTH2                        318
#define ADLTH3                        319
#define ADLTH4                        320
#define ADLTH5                        321
#define ADLTH6                        322
#define ADLTH7                        323
#define ADLTH8                        324
#define ADLTHH                        325
#define ADLTH9                        326
#define ADLTH10                       327
#define ADLTH11                       328
#define ADLTH12                       329
#define ADLTH13                       330
#define ADLTH14                       331
#define ADLTH15                       332
#define ADUTH0                        333
#define ADUTHL                        334
#define ADUTH1                        335
#define ADUTH2                        336
#define ADUTH3                        337
#define ADUTH4                        338
#define ADUTH5                        339
#define ADUTH6                        340
#define ADUTH7                        341
#define ADUTH8                        342
#define ADUTHH                        343
#define ADUTH9                        344
#define ADUTH10                       345
#define ADUTH11                       346
#define ADUTH12                       347
#define ADUTH13                       348
#define ADUTH14                       349
#define ADUTH15                       350
#define ADSTPT0                       351
#define ADSTPTL                       352
#define ADSTPT1                       353
#define ADSTPT2                       354
#define ADSTPT3                       355
#define ADSTPT4                       356
#define ADSTPT5                       357
#define ADSTPT6                       358
#define ADSTPT7                       359
#define ADSTPT8                       360
#define ADSTPTH                       361
#define ADSTPT9                       362
#define ADSTPT10                      363
#define ADSTPT11                      364
#define ADSTPT12                      365
#define ADSTPT13                      366
#define ADSTPT14                      367
#define ADSTPT15                      368
#define ADFLTR0                       369
#define ADFLTRL                       370
#define ADFLTR1                       371
#define ADFLTR2                       372
#define ADFLTR3                       373
#define ADFLTR4                       374
#define ADFLTR5                       375
#define ADFLTR6                       376
#define ADFLTR7                       377
#define ADFLTR8                       378
#define ADFLTRH                       379
#define ADFLTR9                       380
#define ADFLTR10                      381
#define ADFLTR11                      382
#define ADFLTR12                      383
#define ADFLTR13                      384
#define ADFLTR14                      385
#define ADFLTR15                      386
#define ADERR0                        387
#define ADERRL                        388
#define ADERR1                        389
#define ADERR2                        390
#define ADERR3                        391
#define ADERR4                        392
#define ADERR5                        393
#define ADERR6                        394
#define ADERR7                        395
#define ADERR8                        396
#define ADERRH                        397
#define ADERR9                        398
#define ADERR10                       399
#define ADERR11                       400
#define ADERR12                       401
#define ADERR13                       402
#define ADERR14                       403
#define ADERR15                       404
#define RC1REG                        405
#define TX1REG                        406
#define SP1BRGL                       407
#define SP1BRGH                       408
#define RC1STA                        409
#define RX9D                          410
#define OERR                          411
#define FERR                          412
#define ADDEN                         413
#define CREN                          414
#define SREN                          415
#define RX9                           416
#define SPEN                          417
#define TX1STA                        418
#define TX9D                          419
#define TRMT                          420
#define BRGH                          421
#define SENDB                         422
#define TX1STA_SYNC                   423
#define TXEN                          424
#define TX9                           425
#define CSRC                          426
#define BAUD1CON                      427
#define ABDEN                         428
#define WUE                           429
#define BRG16                         430
#define SCKP                          431
#define RCIDL                         432
#define ABDOVF                        433
#define SSP1BUF                       434
#define SSP1BUF_SSPBUF                435
#define SSP1ADD                       436
#define SSP1ADD_SSPADD                437
#define SSP1MSK                       438
#define SSP1MSK_MSK0                  439
#define SSP1MSK_SSPMSK                440
#define SSP1MSK_MSK1                  441
#define SSP1MSK_MSK2                  442
#define SSP1MSK_MSK3                  443
#define SSP1MSK_MSK4                  444
#define SSP1MSK_MSK5                  445
#define SSP1MSK_MSK6                  446
#define SSP1MSK_MSK7                  447
#define SSP1STAT                      448
#define SSP1STAT_BF                   449
#define SSP1STAT_UA                   450
#define SSP1STAT_nWRITE               451
#define SSP1STAT_nW                   452
#define SSP1STAT_READ_WRITE           453
#define SSP1STAT_I2C_READ             454
#define SSP1STAT_R_W                  455
#define SSP1STAT_R_nW                 456
#define SSP1STAT_S                    457
#define SSP1STAT_I2C_START            458
#define SSP1STAT_P                    459
#define SSP1STAT_I2C_STOP             460
#define SSP1STAT_D_A                  461
#define SSP1STAT_D_nA                 462
#define SSP1STAT_DATA_ADDRESS         463
#define SSP1STAT_nA                   464
#define SSP1STAT_nADDRESS             465
#define SSP1STAT_I2C_DAT              466
#define SSP1STAT_CKE                  467
#define SSP1STAT_SMP                  468
#define SSP1CON1                      469
#define SSP1CON1_SSPM                 470
#define SSP1CON1_SSPM0                471
#define SSP1CON1_SSPM1                472
#define SSP1CON1_SSPM2                473
#define SSP1CON1_SSPM3                474
#define SSP1CON1_CKP                  475
#define SSP1CON1_SSPEN                476
#define SSP1CON1_SSPOV                477
#define SSP1CON1_WCOL                 478
#define SSP1CON2                      479
#define SSP1CON2_SEN                  480
#define SSP1CON2_RSEN                 481
#define SSP1CON2_ADMSK1               482
#define SSP1CON2_ADMSK                483
#define SSP1CON2_ADMSK2               484
#define SSP1CON2_PEN                  485
#define SSP1CON2_RCEN                 486
#define SSP1CON2_ADMSK3               487
#define SSP1CON2_ACKEN                488
#define SSP1CON2_ADMSK4               489
#define SSP1CON2_ACKDT                490
#define SSP1CON2_ADMSK5               491
#define SSP1CON2_ACKSTAT              492
#define SSP1CON2_GCEN                 493
#define SSP1CON3                      494
#define SSP1CON3_DHEN                 495
#define SSP1CON3_AHEN                 496
#define SSP1CON3_SBCDE                497
#define SSP1CON3_SDAHT                498
#define SSP1CON3_BOEN                 499
#define SSP1CON3_SCIE                 500
#define SSP1CON3_PCIE                 501
#define SSP1CON3_ACKTIM               502
#define SSP2BUF                       503
#define SSP2BUF_SSPBUF                504
#define SSP2ADD                       505
#define SSP2ADD_SSPADD                506
#define SSP2MSK                       507
#define SSP2MSK_SSPMSK                508
#define SSP2MSK_MSK0                  509
#define SSP2MSK_MSK1                  510
#define SSP2MSK_MSK2                  511
#define SSP2MSK_MSK3                  512
#define SSP2MSK_MSK4                  513
#define SSP2MSK_MSK5                  514
#define SSP2MSK_MSK6                  515
#define SSP2MSK_MSK7                  516
#define SSP2STAT                      517
#define SSP2STAT_BF                   518
#define SSP2STAT_UA                   519
#define SSP2STAT_R_W                  520
#define SSP2STAT_nWRITE               521
