tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18855_tdd.h
#define G3EN                          2207
#define CWG3EN                        2208
#define CWG3CON0_EN                   2209
#define CWG3CON1                      2210
#define CWG3CON1_POLA                 2211
#define CWG3POLA                      2212
#define CWG3CON1_POLB                 2213
#define CWG3POLB                      2214
#define CWG3CON1_POLC                 2215
#define CWG3POLC                      2216
#define CWG3POLD                      2217
#define CWG3CON1_POLD                 2218
#define CWG3IN                        2219
#define CWG3CON1_IN                   2220
#define CWG3AS0                       2221
#define CWG3AS0_LSAC                  2222
#define CWG3LSAC0                     2223
#define CWG3AS0_LSAC0                 2224
#define CWG3LSAC                      2225
#define CWG3LSAC1                     2226
#define CWG3AS0_LSAC1                 2227
#define CWG3LSBD                      2228
#define CWG3AS0_LSBD                  2229
#define CWG3LSBD0                     2230
#define CWG3AS0_LSBD0                 2231
#define CWG3LSBD1                     2232
#define CWG3AS0_LSBD1                 2233
#define CWG3AS0_REN                   2234
#define CWG3REN                       2235
#define CWG3SHUTDOWN                  2236
#define CWG3AS0_SHUTDOWN              2237
#define CWG3AS1                       2238
#define CWG3AS1_AS0E                  2239
#define CWG3AS1_AS1E                  2240
#define CWG3AS1_AS2E                  2241
#define CWG3AS1_AS3E                  2242
#define CWG3AS1_AS4E                  2243
#define CWG3AS1_AS5E                  2244
#define CWG3AS1_AS6E                  2245
#define CWG3STR                       2246
#define CWG3STRA                      2247
#define CWG3STR_STRA                  2248
#define CWG3STRB                      2249
#define CWG3STR_STRB                  2250
#define CWG3STRC                      2251
#define CWG3STR_STRC                  2252
#define CWG3STR_STRD                  2253
#define CWG3STRD                      2254
#define CWG3STR_OVRA                  2255
#define CWG3OVRA                      2256
#define CWG3STR_OVRB                  2257
#define CWG3OVRB                      2258
#define CWG3STR_OVRC                  2259
#define CWG3OVRC                      2260
#define CWG3OVRD                      2261
#define CWG3STR_OVRD                  2262
#define PIR0                          2263
#define INTF                          2264
#define IOCIF                         2265
#define TMR0IF                        2266
#define PIR1                          2267
#define ADIF                          2268
#define ADTIF                         2269
#define CSWIF                         2270
#define OSFIF                         2271
#define PIR2                          2272
#define C1IF                          2273
#define C2IF                          2274
#define ZCDIF                         2275
#define PIR3                          2276
#define SSP1IF                        2277
#define BCL1IF                        2278
#define SSP2IF                        2279
#define BCL2IF                        2280
#define TXIF                          2281
#define RCIF                          2282
#define PIR4                          2283
#define TMR1IF                        2284
#define TMR2IF                        2285
#define TMR3IF                        2286
#define TMR4IF                        2287
#define TMR5IF                        2288
#define TMR6IF                        2289
#define PIR5                          2290
#define TMR1GIF                       2291
#define TMR3GIF                       2292
#define TMR5GIF                       2293
#define CLC1IF                        2294
#define CLC2IF                        2295
#define CLC3IF                        2296
#define CLC4IF                        2297
#define PIR6                          2298
#define CCP1IF                        2299
#define CCP2IF                        2300
#define CCP3IF                        2301
#define CCP4IF                        2302
#define CCP5IF                        2303
#define PIR7                          2304
#define CWG1IF                        2305
#define CWG2IF                        2306
#define CWG3IF                        2307
#define NCO1IF                        2308
#define NCOIF                         2309
#define NVMIF                         2310
#define CRCIF                         2311
#define SCANIF                        2312
#define PIR8                          2313
#define SMT1IF                        2314
#define SMT1PRAIF                     2315
#define SMT1PWAIF                     2316
#define SMT2IF                        2317
#define SMT2PRAIF                     2318
#define SMT2PWAIF                     2319
#define PIE0                          2320
#define INTE                          2321
#define IOCIE                         2322
#define TMR0IE                        2323
#define PIE1                          2324
#define ADIE                          2325
#define ADTIE                         2326
#define CSWIE                         2327
#define OSFIE                         2328
#define PIE2                          2329
#define C1IE                          2330
#define C2IE                          2331
#define ZCDIE                         2332
#define PIE3                          2333
#define SSP1IE                        2334
#define BCL1IE                        2335
#define SSP2IE                        2336
#define BCL2IE                        2337
#define TXIE                          2338
#define RCIE                          2339
#define PIE4                          2340
#define TMR1IE                        2341
#define TMR2IE                        2342
#define TMR3IE                        2343
#define TMR4IE                        2344
#define TMR5IE                        2345
#define TMR6IE                        2346
#define PIE5                          2347
#define TMR1GIE                       2348
#define TMR3GIE                       2349
#define TMR5GIE                       2350
#define CLC1IE                        2351
#define CLC2IE                        2352
#define CLC3IE                        2353
#define CLC4IE                        2354
#define PIE6                          2355
#define CCP1IE                        2356
#define CCP2IE                        2357
#define CCP3IE                        2358
#define CCP4IE                        2359
#define CCP5IE                        2360
#define PIE7                          2361
#define CWG1IE                        2362
#define CWG2IE                        2363
#define CWG3IE                        2364
#define NCO1IE                        2365
#define NCOIE                         2366
#define NVMIE                         2367
#define CRCIE                         2368
#define SCANIE                        2369
#define PIE8                          2370
#define SMT1IE                        2371
#define SMT1PRAIE                     2372
#define SMT1PWAIE                     2373
#define SMT2IE                        2374
#define SMT2PRAIE                     2375
#define SMT2PWAIE                     2376
#define PMD0                          2377
#define IOCMD                         2378
#define CLKRMD                        2379
#define NVMMD                         2380
#define SCANMD                        2381
#define CRCMD                         2382
#define FVRMD                         2383
#define SYSCMD                        2384
#define PMD1                          2385
#define TMR0MD                        2386
#define TMR1MD                        2387
#define TMR2MD                        2388
#define TMR3MD                        2389
#define TMR4MD                        2390
#define TMR5MD                        2391
#define TMR6MD                        2392
#define NCOMD                         2393
#define NCO1MD                        2394
#define PMD2                          2395
#define ZCDMD                         2396
#define CMP1MD                        2397
#define CMP2MD                        2398
#define ADCMD                         2399
#define DACMD                         2400
#define PMD3                          2401
#define CCP1MD                        2402
#define CCP2MD                        2403
#define CCP3MD                        2404
#define CCP4MD                        2405
#define CCP5MD                        2406
#define PWM6MD                        2407
#define PWM7MD                        2408
#define PMD4                          2409
#define CWG1MD                        2410
#define CWG2MD                        2411
#define CWG3MD                        2412
#define MSSP1MD                       2413
#define MSSP2MD                       2414
#define UART1MD                       2415
#define PMD5                          2416
#define DSMMD                         2417
#define CLC1MD                        2418
#define CLC2MD                        2419
#define CLC3MD                        2420
#define CLC4MD                        2421
#define SMT1MD                        2422
#define SMT2MD                        2423
#define WDTCON0                       2424
#define WDTCON0_SEN                   2425
#define SWDTEN                        2426
#define WDTSEN                        2427
#define WDTPS                         2428
#define WDTPS0                        2429
#define WDTPS1                        2430
#define WDTPS2                        2431
#define WDTPS3                        2432
#define WDTPS4                        2433
#define WDTCON1                       2434
#define WDTWINDOW0                    2435
#define WINDOW0                       2436
#define WINDOW                        2437
#define WDTWINDOW                     2438
#define WDTWINDOW1                    2439
#define WINDOW1                       2440
#define WDTWINDOW2                    2441
#define WINDOW2                       2442
#define WDTCS                         2443
#define WDTCS0                        2444
#define WDTCS1                        2445
#define WDTCS2                        2446
#define WDTPSL                        2447
#define WDTPSL_WDTPSCNT               2448
#define WDTPSL_PSCNT                  2449
#define WDTPSCNT0                     2450
#define PSCNT0                        2451
#define WDTPSCNT1                     2452
#define PSCNT1                        2453
#define WDTPSCNT2                     2454
#define PSCNT2                        2455
#define WDTPSCNT3                     2456
#define PSCNT3                        2457
#define WDTPSCNT4                     2458
#define PSCNT4                        2459
#define WDTPSCNT5                     2460
#define PSCNT5                        2461
#define WDTPSCNT6                     2462
#define PSCNT6                        2463
#define WDTPSCNT7                     2464
#define PSCNT7                        2465
#define WDTPSH                        2466
#define PSCNT8                        2467
#define WDTPSH_WDTPSCNT               2468
#define WDTPSH_PSCNT                  2469
#define WDTPSCNT8                     2470
#define PSCNT9                        2471
#define WDTPSCNT9                     2472
#define PSCNT10                       2473
#define WDTPSCNT10                    2474
#define PSCNT11                       2475
#define WDTPSCNT11                    2476
#define PSCNT12                       2477
#define WDTPSCNT12                    2478
#define PSCNT13                       2479
#define WDTPSCNT13                    2480
#define PSCNT14                       2481
#define WDTPSCNT14                    2482
#define PSCNT15                       2483
#define WDTPSCNT15                    2484
#define PSCNT16                       2485
#define WDTPSCNT16                    2486
#define WDTPSCNT17                    2487
#define PSCNT17                       2488
#define STATE                         2489
#define WDTSTATE                      2490
#define WDTTMR                        2491
#define WDTTMR0                       2492
#define WDTTMR1                       2493
#define WDTTMR2                       2494
#define WDTTMR3                       2495
#define BORCON                        2496
#define BORRDY                        2497
#define SBOREN                        2498
#define PCON0                         2499
#define nBOR                          2500
#define nPOR                          2501
#define nRI                           2502
#define nRMCLR                        2503
#define nRWDT                         2504
#define nWDTWV                        2505
#define STKUNF                        2506
#define STKOVF                        2507
#define CCDCON                        2508
#define CCDS0                         2509
#define CCDS1                         2510
#define CCDEN                         2511
#define NVMADRL                       2512
#define NVMADR0                       2513
#define NVMADR1                       2514
#define NVMADR2                       2515
#define NVMADR3                       2516
#define NVMADR4                       2517
#define NVMADR5                       2518
#define NVMADR6                       2519
#define NVMADR7                       2520
#define NVMADRH                       2521
#define NVMADR8                       2522
#define NVMADR9                       2523
#define NVMADR10                      2524
#define NVMADR11                      2525
#define NVMADR12                      2526
#define NVMADR13                      2527
#define NVMADR14                      2528
#define NVMDATL                       2529
#define NVMDAT0                       2530
#define NVMDAT1                       2531
#define NVMDAT2                       2532
#define NVMDAT3                       2533
#define NVMDAT4                       2534
#define NVMDAT5                       2535
#define NVMDAT6                       2536
#define NVMDAT7                       2537
#define NVMDATH                       2538
#define NVMDAT8                       2539
#define NVMDAT9                       2540
#define NVMDAT10                      2541
#define NVMDAT11                      2542
#define NVMDAT12                      2543
#define NVMDAT13                      2544
#define NVMCON1                       2545
#define RD                            2546
#define WR                            2547
#define WREN                          2548
#define WRERR                         2549
#define FREE                          2550
#define LWLO                          2551
#define NVMREGS                       2552
#define CPUDOZE                       2553
#define DOZE0                         2554
#define DOZE1                         2555
#define DOZE2                         2556
#define DOE                           2557
#define ROI                           2558
#define DOZEN                         2559
#define IDLEN                         2560
#define OSCCON1                       2561
#define NDIV0                         2562
#define NDIV                          2563
#define NDIV1                         2564
#define NDIV2                         2565
#define NDIV3                         2566
#define NOSC0                         2567
#define NOSC                          2568
#define NOSC1                         2569
#define NOSC2                         2570
#define OSCCON2                       2571
#define CDIV0                         2572
#define CDIV                          2573
#define CDIV1                         2574
#define CDIV2                         2575
#define CDIV3                         2576
#define COSC                          2577
#define COSC0                         2578
#define COSC1                         2579
#define COSC2                         2580
#define OSCCON3                       2581
#define NOSCR                         2582
#define ORDY                          2583
#define SOSCPWR                       2584
#define CSWHOLD                       2585
#define OSCSTAT                       2586
#define PLLR                          2587
#define ADOR                          2588
#define SOR                           2589
#define LFOR                          2590
#define MFOR                          2591
#define HFOR                          2592
#define EXTOR                         2593
#define OSCEN                         2594
#define ADOEN                         2595
#define SOSCEN                        2596
#define LFOEN                         2597
#define MFOEN                         2598
#define HFOEN                         2599
#define EXTOEN                        2600
#define OSCTUNE                       2601
#define HFTUN0                        2602
#define HFTUN                         2603
#define HFTUN1                        2604
#define HFTUN2                        2605
#define HFTUN3                        2606
#define HFTUN4                        2607
#define HFTUN5                        2608
#define OSCFRQ                        2609
#define HFFRQ                         2610
#define HFFRQ0                        2611
#define HFFRQ1                        2612
#define HFFRQ2                        2613
#define CLKRCON                       2614
#define CLKRDIV                       2615
#define CLKRDIV0                      2616
#define CLKRDIV1                      2617
#define CLKRDIV2                      2618
#define CLKRDC                        2619
#define CLKRDC0                       2620
#define CLKRDC1                       2621
#define CLKREN                        2622
#define CLKRCLK                       2623
#define CLKRCLK0                      2624
#define CLKRCLK1                      2625
#define CLKRCLK2                      2626
#define CLKRCLK3                      2627
#define MDCON0                        2628
#define MDBIT                         2629
#define MDOPOL                        2630
#define MDOUT                         2631
#define MDEN                          2632
#define MDCON1                        2633
#define MDCLSYNC                      2634
#define MDCLPOL                       2635
#define MDCHSYNC                      2636
#define MDCHPOL                       2637
#define MDSRC                         2638
#define MDMS0                         2639
#define MDMS                          2640
#define MDMS1                         2641
#define MDMS2                         2642
#define MDMS3                         2643
#define MDMS4                         2644
#define MDCARL                        2645
#define MDCL0                         2646
#define MDCL                          2647
#define MDCL1                         2648
#define MDCL2                         2649
#define MDCL3                         2650
#define MDCARH                        2651
#define MDCH                          2652
#define MDCH0                         2653
#define MDCH1                         2654
#define MDCH2                         2655
#define MDCH3                         2656
#define FVRCON                        2657
#define ADFVR0                        2658
#define ADFVR                         2659
#define ADFVR1                        2660
#define CDAFVR                        2661
#define CDAFVR0                       2662
#define CDAFVR1                       2663
#define TSRNG                         2664
#define TSEN                          2665
#define FVRRDY                        2666
#define FVREN                         2667
#define DAC1CON0                      2668
#define NSS                           2669
#define DAC1NSS                       2670
#define DAC1PSS0                      2671
#define PSS                           2672
#define PSS0                          2673
#define PSS1                          2674
#define DAC1PSS1                      2675
#define OE2                           2676
#define DAC1OE2                       2677
#define OE1                           2678
#define DAC1OE1                       2679
#define DAC1CON0_EN                   2680
#define DAC1EN                        2681
#define DAC1CON1                      2682
#define DAC1R                         2683
#define DAC1R0                        2684
#define DAC1R1                        2685
#define DAC1R2                        2686
#define DAC1R3                        2687
#define DAC1R4                        2688
#define ZCD1CON                       2689
#define ZCD1CON_INTN                  2690
#define ZCDINTN                       2691
#define ZCD1INTN                      2692
#define ZCD1INTP                      2693
#define ZCD1CON_INTP                  2694
#define ZCDINTP                       2695
#define ZCDPOL                        2696
#define ZCD1CON_POL                   2697
#define ZCD1POL                       2698
#define ZCDOUT                        2699
#define ZCD1OUT                       2700
#define ZCD1CON_OUT                   2701
#define ZCDEN                         2702
#define ZCD1EN                        2703
#define ZCD1CON_EN                    2704
#define CMOUT                         2705
#define CMOUT_C1OUT                   2706
#define MC1OUT                        2707
#define MC2OUT                        2708
#define CMOUT_C2OUT                   2709
#define CM1CON0                       2710
#define CM1CON0_SYNC                  2711
#define C1SYNC                        2712
#define CM1CON0_HYS                   2713
#define C1HYS                         2714
#define C1SP                          2715
#define CM1CON0_POL                   2716
#define C1POL                         2717
#define CM1CON0_OUT                   2718
#define CM1CON0_C1OUT                 2719
#define CM1CON0_ON                    2720
#define C1ON                          2721
#define CM1CON1                       2722
#define C1INTN                        2723
#define CM1CON1_INTN                  2724
#define CM1CON1_INTP                  2725
#define C1INTP                        2726
#define CM1NSEL                       2727
#define CM1NSEL_NCH0                  2728
#define C1NCH0                        2729
#define CM1NSEL_NCH                   2730
#define C1NCH                         2731
#define CM1NSEL_NCH1                  2732
#define C1NCH1                        2733
#define CM1NSEL_NCH2                  2734
#define C1NCH2                        2735
#define CM1PSEL                       2736
#define CM1PSEL_PCH                   2737
#define C1PCH                         2738
#define C1PCH0                        2739
#define CM1PSEL_PCH0                  2740
#define C1PCH1                        2741
#define CM1PSEL_PCH1                  2742
#define C1PCH2                        2743
#define CM1PSEL_PCH2                  2744
#define CM2CON0                       2745
#define CM2CON0_SYNC                  2746
#define C2SYNC                        2747
#define C2HYS                         2748
#define CM2CON0_HYS                   2749
#define C2SP                          2750
#define C2POL                         2751
#define CM2CON0_POL                   2752
#define CM2CON0_C2OUT                 2753
#define CM2CON0_OUT                   2754
#define CM2CON0_ON                    2755
#define C2ON                          2756
#define CM2CON1                       2757
#define C2INTN                        2758
#define CM2CON1_INTN                  2759
#define CM2CON1_INTP                  2760
#define C2INTP                        2761
#define CM2NSEL                       2762
#define C2NCH0                        2763
#define CM2NSEL_NCH0                  2764
