tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18855_tdd.h
#define C2NCH                         2765
#define CM2NSEL_NCH                   2766
#define C2NCH1                        2767
#define CM2NSEL_NCH1                  2768
#define C2NCH2                        2769
#define CM2NSEL_NCH2                  2770
#define CM2PSEL                       2771
#define CM2PSEL_PCH                   2772
#define C2PCH                         2773
#define C2PCH0                        2774
#define CM2PSEL_PCH0                  2775
#define C2PCH1                        2776
#define CM2PSEL_PCH1                  2777
#define CM2PSEL_PCH2                  2778
#define C2PCH2                        2779
#define CLCDATA                       2780
#define MLC1OUT                       2781
#define MLC2OUT                       2782
#define MLC3OUT                       2783
#define MLC4OUT                       2784
#define CLC1CON                       2785
#define CLC1CON_MODE                  2786
#define LC1MODE0                      2787
#define LC1MODE                       2788
#define CLC1CON_MODE0                 2789
#define LC1MODE1                      2790
#define CLC1CON_MODE1                 2791
#define LC1MODE2                      2792
#define CLC1CON_MODE2                 2793
#define LC1INTN                       2794
#define CLC1CON_INTN                  2795
#define LC1INTP                       2796
#define CLC1CON_INTP                  2797
#define LC1OUT                        2798
#define CLC1CON_OUT                   2799
#define LC1EN                         2800
#define CLC1CON_EN                    2801
#define CLC1POL                       2802
#define LC1G1POL                      2803
#define CLC1POL_G1POL                 2804
#define CLC1POL_G2POL                 2805
#define LC1G2POL                      2806
#define LC1G3POL                      2807
#define CLC1POL_G3POL                 2808
#define LC1G4POL                      2809
#define CLC1POL_G4POL                 2810
#define CLC1POL_POL                   2811
#define LC1POL                        2812
#define CLC1SEL0                      2813
#define LC1D1S                        2814
#define CLC1SEL0_D1S0                 2815
#define LC1D1S0                       2816
#define CLC1SEL0_D1S                  2817
#define CLC1SEL0_D1S1                 2818
#define LC1D1S1                       2819
#define CLC1SEL0_D1S2                 2820
#define LC1D1S2                       2821
#define CLC1SEL0_D1S3                 2822
#define LC1D1S3                       2823
#define LC1D1S4                       2824
#define CLC1SEL0_D1S4                 2825
#define CLC1SEL0_D1S5                 2826
#define LC1D1S5                       2827
#define LC1D1S6                       2828
#define CLC1SEL0_D1S6                 2829
#define LC1D1S7                       2830
#define CLC1SEL0_D1S7                 2831
#define CLC1SEL1                      2832
#define CLC1SEL1_D2S                  2833
#define CLC1SEL1_D2S0                 2834
#define LC1D2S0                       2835
#define LC1D2S                        2836
#define CLC1SEL1_D2S1                 2837
#define LC1D2S1                       2838
#define CLC1SEL1_D2S2                 2839
#define LC1D2S2                       2840
#define CLC1SEL1_D2S3                 2841
#define LC1D2S3                       2842
#define LC1D2S4                       2843
#define CLC1SEL1_D2S4                 2844
#define D2S5                          2845
#define LC1D2S5                       2846
#define LC1D2S6                       2847
#define CLC1SEL1_D2S6                 2848
#define CLC1SEL1_D2S7                 2849
#define LC1D2S7                       2850
#define CLC1SEL2                      2851
#define CLC1SEL2_D3S                  2852
#define LC1D3S0                       2853
#define LC1D3S                        2854
#define CLC1SEL2_D3S0                 2855
#define LC1D3S1                       2856
#define CLC1SEL2_D3S1                 2857
#define LC1D3S2                       2858
#define CLC1SEL2_D3S2                 2859
#define LC1D3S3                       2860
#define CLC1SEL2_D3S3                 2861
#define LC1D3S4                       2862
#define CLC1SEL2_D3S4                 2863
#define LC1D3S5                       2864
#define CLC1SEL2_D3S5                 2865
#define LC1D3S6                       2866
#define CLC1SEL2_D3S6                 2867
#define LC1D3S7                       2868
#define CLC1SEL2_D3S7                 2869
#define CLC1SEL3                      2870
#define LC1D4S                        2871
#define CLC1SEL3_D4S                  2872
#define LC1D4S0                       2873
#define CLC1SEL3_D4S0                 2874
#define LC1D4S1                       2875
#define CLC1SEL3_D4S1                 2876
#define LC1D4S2                       2877
#define CLC1SEL3_D4S2                 2878
#define LC1D4S3                       2879
#define CLC1SEL3_D4S3                 2880
#define LC1D4S4                       2881
#define CLC1SEL3_D4S4                 2882
#define LC1D4S5                       2883
#define CLC1SEL3_D4S5                 2884
#define LC1D4S6                       2885
#define CLC1SEL3_D4S6                 2886
#define LC1D4S7                       2887
#define CLC1SEL3_D4S7                 2888
#define CLC1GLS0                      2889
#define CLC1GLS0_D1N                  2890
#define LC1G1D1N                      2891
#define CLC1GLS0_D1T                  2892
#define LC1G1D1T                      2893
#define LC1G1D2N                      2894
#define CLC1GLS0_D2N                  2895
#define LC1G1D2T                      2896
#define CLC1GLS0_D2T                  2897
#define CLC1GLS0_D3N                  2898
#define LC1G1D3N                      2899
#define CLC1GLS0_D3T                  2900
#define LC1G1D3T                      2901
#define CLC1GLS0_D4N                  2902
#define LC1G1D4N                      2903
#define CLC1GLS0_D4T                  2904
#define LC1G1D4T                      2905
#define CLC1GLS1                      2906
#define CLC1GLS1_D1N                  2907
#define LC1G2D1N                      2908
#define LC1G2D1T                      2909
#define CLC1GLS1_D1T                  2910
#define CLC1GLS1_D2N                  2911
#define LC1G2D2N                      2912
#define LC1G2D2T                      2913
#define CLC1GLS1_D2T                  2914
#define CLC1GLS1_D3N                  2915
#define LC1G2D3N                      2916
#define LC1G2D3T                      2917
#define CLC1GLS1_D3T                  2918
#define CLC1GLS1_D4N                  2919
#define LC1G2D4N                      2920
#define LC1G2D4T                      2921
#define CLC1GLS1_D4T                  2922
#define CLC1GLS2                      2923
#define CLC1GLS2_D1N                  2924
#define LC1G3D1N                      2925
#define LC1G3D1T                      2926
#define CLC1GLS2_D1T                  2927
#define LC1G3D2N                      2928
#define CLC1GLS2_D2N                  2929
#define LC1G3D2T                      2930
#define CLC1GLS2_D2T                  2931
#define CLC1GLS2_D3N                  2932
#define LC1G3D3N                      2933
#define LC1G3D3T                      2934
#define CLC1GLS2_D3T                  2935
#define LC1G3D4N                      2936
#define CLC1GLS2_D4N                  2937
#define LC1G3D4T                      2938
#define CLC1GLS2_D4T                  2939
#define CLC1GLS3                      2940
#define LC1G4D1N                      2941
#define CLC1GLS3_G4D1N                2942
#define LC1G4D1T                      2943
#define CLC1GLS3_G4D1T                2944
#define CLC1GLS3_G4D2N                2945
#define LC1G4D2N                      2946
#define CLC1GLS3_G4D2T                2947
#define LC1G4D2T                      2948
#define LC1G4D3N                      2949
#define CLC1GLS3_G4D3N                2950
#define LC1G4D3T                      2951
#define CLC1GLS3_G4D3T                2952
#define CLC1GLS3_G4D4N                2953
#define LC1G4D4N                      2954
#define CLC1GLS3_G4D4T                2955
#define LC1G4D4T                      2956
#define CLC2CON                       2957
#define LC2MODE0                      2958
#define CLC2CON_MODE                  2959
#define LC2MODE                       2960
#define CLC2CON_MODE0                 2961
#define LC2MODE1                      2962
#define CLC2CON_MODE1                 2963
#define LC2MODE2                      2964
#define CLC2CON_MODE2                 2965
#define LC2INTN                       2966
#define CLC2CON_INTN                  2967
#define LC2INTP                       2968
#define CLC2CON_INTP                  2969
#define CLC2CON_OUT                   2970
#define LC2OUT                        2971
#define CLC2CON_EN                    2972
#define LC2EN                         2973
#define CLC2POL                       2974
#define LC2G1POL                      2975
#define CLC2POL_G1POL                 2976
#define LC2G2POL                      2977
#define CLC2POL_G2POL                 2978
#define LC2G3POL                      2979
#define CLC2POL_G3POL                 2980
#define LC2G4POL                      2981
#define CLC2POL_G4POL                 2982
#define CLC2POL_POL                   2983
#define LC2POL                        2984
#define CLC2SEL0                      2985
#define CLC2SEL0_D1S                  2986
#define LC2D1S                        2987
#define LC2D1S0                       2988
#define CLC2SEL0_D1S0                 2989
#define LC2D1S1                       2990
#define CLC2SEL0_D1S1                 2991
#define LC2D1S2                       2992
#define CLC2SEL0_D1S2                 2993
#define LC2D1S3                       2994
#define CLC2SEL0_D1S3                 2995
#define LC2D1S4                       2996
#define CLC2SEL0_D1S4                 2997
#define LC2D1S5                       2998
#define CLC2SEL0_D1S5                 2999
#define LC2D1S6                       3000
#define CLC2SEL0_D1S6                 3001
#define LC2D1S7                       3002
#define CLC2SEL0_D1S7                 3003
#define CLC2SEL1                      3004
#define LC2D2S0                       3005
#define LC2D2S                        3006
#define CLC2SEL1_D2S                  3007
#define CLC2SEL1_D2S0                 3008
#define LC2D2S1                       3009
#define CLC2SEL1_D2S1                 3010
#define LC2D2S2                       3011
#define CLC2SEL1_D2S2                 3012
#define LC2D2S3                       3013
#define CLC2SEL1_D2S3                 3014
#define LC2D2S4                       3015
#define CLC2SEL1_D2S4                 3016
#define LC2D2S5                       3017
#define CLC2SEL1_D2S5                 3018
#define LC2D2S6                       3019
#define CLC2SEL1_D2S6                 3020
#define LC2D2S7                       3021
#define CLC2SEL1_D2S7                 3022
#define CLC2SEL2                      3023
#define CLC2SEL2_D3S0                 3024
#define LC2D3S                        3025
#define CLC2SEL2_D3S                  3026
#define LC2D3S0                       3027
#define CLC2SEL2_D3S1                 3028
#define LC2D3S1                       3029
#define CLC2SEL2_D3S2                 3030
#define LC2D3S2                       3031
#define CLC2SEL2_D3S3                 3032
#define LC2D3S3                       3033
#define CLC2SEL2_D3S4                 3034
#define LC2D3S4                       3035
#define CLC2SEL2_D3S5                 3036
#define LC2D3S5                       3037
#define CLC2SEL2_D3S6                 3038
#define LC2D3S6                       3039
#define CLC2SEL2_D3S7                 3040
#define LC2D3S7                       3041
#define CLC2SEL3                      3042
#define LC2D4S                        3043
#define CLC2SEL3_D4S0                 3044
#define LC2D4S0                       3045
#define CLC2SEL3_D4S                  3046
#define CLC2SEL3_D4S1                 3047
#define LC2D4S1                       3048
#define CLC2SEL3_D4S2                 3049
#define LC2D4S2                       3050
#define CLC2SEL3_D4S3                 3051
#define LC2D4S3                       3052
#define CLC2SEL3_D4S4                 3053
#define LC2D4S4                       3054
#define CLC2SEL3_D4S5                 3055
#define LC2D4S5                       3056
#define CLC2SEL3_D4S6                 3057
#define LC2D4S6                       3058
#define CLC2SEL3_D4S7                 3059
#define LC2D4S7                       3060
#define CLC2GLS0                      3061
#define LC2G1D1N                      3062
#define CLC2GLS0_D1N                  3063
#define CLC2GLS0_D1T                  3064
#define LC2G1D1T                      3065
#define LC2G1D2N                      3066
#define CLC2GLS0_D2N                  3067
#define CLC2GLS0_D2T                  3068
#define LC2G1D2T                      3069
#define LC2G1D3N                      3070
#define CLC2GLS0_D3N                  3071
#define CLC2GLS0_D3T                  3072
#define LC2G1D3T                      3073
#define LC2G1D4N                      3074
#define CLC2GLS0_D4N                  3075
#define CLC2GLS0_D4T                  3076
#define LC2G1D4T                      3077
#define CLC2GLS1                      3078
#define CLC2GLS1_D1N                  3079
#define LC2G2D1N                      3080
#define CLC2GLS1_D1T                  3081
#define LC2G2D1T                      3082
#define CLC2GLS1_D2N                  3083
#define LC2G2D2N                      3084
#define CLC2GLS1_D2T                  3085
#define LC2G2D2T                      3086
#define LC2G2D3N                      3087
#define CLC2GLS1_D3N                  3088
#define LC2G2D3T                      3089
#define CLC2GLS1_D3T                  3090
#define LC2G2D4N                      3091
#define CLC2GLS1_D4N                  3092
#define LC2G2D4T                      3093
#define CLC2GLS1_D4T                  3094
#define CLC2GLS2                      3095
#define LC2G3D1N                      3096
#define CLC2GLS2_D1N                  3097
#define CLC2GLS2_D1T                  3098
#define LC2G3D1T                      3099
#define CLC2GLS2_D2N                  3100
#define LC2G3D2N                      3101
#define LC2G3D2T                      3102
#define CLC2GLS2_D2T                  3103
#define CLC2GLS2_D3N                  3104
#define LC2G3D3N                      3105
#define CLC2GLS2_D3T                  3106
#define LC2G3D3T                      3107
#define CLC2GLS2_D4N                  3108
#define LC2G3D4N                      3109
#define LC2G3D4T                      3110
#define CLC2GLS2_D4T                  3111
#define CLC2GLS3                      3112
#define LC2G4D1N                      3113
#define CLC2GLS3_G4D1N                3114
#define CLC2GLS3_G4D1T                3115
#define LC2G4D1T                      3116
#define CLC2GLS3_G4D2N                3117
#define LC2G4D2N                      3118
#define LC2G4D2T                      3119
#define CLC2GLS3_G4D2T                3120
#define CLC2GLS3_G4D3N                3121
#define LC2G4D3N                      3122
#define CLC2GLS3_G4D3T                3123
#define LC2G4D3T                      3124
#define LC2G4D4N                      3125
#define CLC2GLS3_G4D4N                3126
#define CLC2GLS3_G4D4T                3127
#define LC2G4D4T                      3128
#define CLC3CON                       3129
#define LC3MODE                       3130
#define CLC3CON_MODE0                 3131
#define LC3MODE0                      3132
#define CLC3CON_MODE                  3133
#define CLC3CON_MODE1                 3134
#define LC3MODE1                      3135
#define CLC3CON_MODE2                 3136
#define LC3MODE2                      3137
#define LC3INTN                       3138
#define CLC3CON_INTN                  3139
#define LC3INTP                       3140
#define CLC3CON_INTP                  3141
#define LC3OUT                        3142
#define CLC3CON_OUT                   3143
#define LC3EN                         3144
#define CLC3CON_EN                    3145
#define CLC3POL                       3146
#define LC3G1POL                      3147
#define CLC3POL_G1POL                 3148
#define LC3G2POL                      3149
#define CLC3POL_G2POL                 3150
#define CLC3POL_G3POL                 3151
#define LC3G3POL                      3152
#define LC3G4POL                      3153
#define CLC3POL_G4POL                 3154
#define LC3POL                        3155
#define CLC3POL_POL                   3156
#define CLC3SEL0                      3157
#define LC3D1S                        3158
#define CLC3SEL0_D1S                  3159
#define LC3D1S0                       3160
#define CLC3SEL0_D1S0                 3161
#define LC3D1S1                       3162
#define CLC3SEL0_D1S1                 3163
#define LC3D1S2                       3164
#define CLC3SEL0_D1S2                 3165
#define LC3D1S3                       3166
#define CLC3SEL0_D1S3                 3167
#define LC3D1S4                       3168
#define CLC3SEL0_D1S4                 3169
#define LC3D1S5                       3170
#define CLC3SEL0_D1S5                 3171
#define LC3D1S6                       3172
#define CLC3SEL0_D1S6                 3173
#define LC3D1S7                       3174
#define CLC3SEL0_D1S7                 3175
#define CLC3SEL1                      3176
#define LC3D2S0                       3177
#define LC3D2S                        3178
#define CLC3SEL1_D2S0                 3179
#define CLC3SEL1_D2S                  3180
#define LC3D2S1                       3181
#define CLC3SEL1_D2S1                 3182
#define LC3D2S2                       3183
#define CLC3SEL1_D2S2                 3184
#define LC3D2S3                       3185
#define CLC3SEL1_D2S3                 3186
#define LC3D2S4                       3187
#define CLC3SEL1_D2S4                 3188
#define LC3D2S5                       3189
#define CLC3SEL1_D2S5                 3190
#define LC3D2S6                       3191
#define CLC3SEL1_D2S6                 3192
#define LC3D2S7                       3193
#define CLC3SEL1_D2S7                 3194
#define CLC3SEL2                      3195
#define LC3D3S                        3196
#define CLC3SEL2_D3S                  3197
#define LC3D3S0                       3198
#define CLC3SEL2_D3S0                 3199
#define LC3D3S1                       3200
#define CLC3SEL2_D3S1                 3201
#define LC3D3S2                       3202
#define CLC3SEL2_D3S2                 3203
#define LC3D3S3                       3204
#define CLC3SEL2_D3S3                 3205
#define LC3D3S4                       3206
#define CLC3SEL2_D3S4                 3207
#define LC3D3S5                       3208
#define CLC3SEL2_D3S5                 3209
#define LC3D3S6                       3210
#define CLC3SEL2_D3S6                 3211
#define LC3D3S7                       3212
#define CLC3SEL2_D3S7                 3213
#define CLC3SEL3                      3214
#define CLC3SEL3_D4S                  3215
#define LC3D4S0                       3216
#define LC3D4S                        3217
#define CLC3SEL3_D4S0                 3218
#define LC3D4S1                       3219
#define CLC3SEL3_D4S1                 3220
#define LC3D4S2                       3221
#define CLC3SEL3_D4S2                 3222
#define LC3D4S3                       3223
#define CLC3SEL3_D4S3                 3224
#define LC3D4S4                       3225
#define CLC3SEL3_D4S4                 3226
#define LC3D4S5                       3227
#define CLC3SEL3_D4S5                 3228
#define LC3D4S6                       3229
#define CLC3SEL3_D4S6                 3230
#define LC3D4S7                       3231
#define CLC3SEL3_D4S7                 3232
#define CLC3GLS0                      3233
#define CLC3GLS0_D1N                  3234
#define LC3G1D1N                      3235
#define LC3G1D1T                      3236
#define CLC3GLS0_D1T                  3237
#define LC3G1D2N                      3238
#define CLC3GLS0_D2N                  3239
#define CLC3GLS0_D2T                  3240
#define LC3G1D2T                      3241
#define CLC3GLS0_D3N                  3242
#define LC3G1D3N                      3243
#define LC3G1D3T                      3244
#define CLC3GLS0_D3T                  3245
#define CLC3GLS0_D4N                  3246
#define LC3G1D4N                      3247
#define CLC3GLS0_D4T                  3248
#define LC3G1D4T                      3249
#define CLC3GLS1                      3250
#define LC3G2D1N                      3251
#define CLC3GLS1_D1N                  3252
#define CLC3GLS1_D1T                  3253
#define LC3G2D1T                      3254
#define LC3G2D2N                      3255
#define CLC3GLS1_D2N                  3256
#define LC3G2D2T                      3257
#define CLC3GLS1_D2T                  3258
#define LC3G2D3N                      3259
#define CLC3GLS1_D3N                  3260
#define CLC3GLS1_D3T                  3261
#define LC3G2D3T                      3262
#define LC3G2D4N                      3263
#define CLC3GLS1_D4N                  3264
#define LC3G2D4T                      3265
#define CLC3GLS1_D4T                  3266
#define CLC3GLS2                      3267
#define LC3G3D1N                      3268
#define CLC3GLS2_D1N                  3269
#define LC3G3D1T                      3270
#define CLC3GLS2_D1T                  3271
#define CLC3GLS2_D2N                  3272
#define LC3G3D2N                      3273
#define CLC3GLS2_D2T                  3274
#define LC3G3D2T                      3275
#define CLC3GLS2_D3N                  3276
#define LC3G3D3N                      3277
#define LC3G3D3T                      3278
#define CLC3GLS2_D3T                  3279
#define CLC3GLS2_D4N                  3280
#define LC3G3D4N                      3281
#define CLC3GLS2_D4T                  3282
#define LC3G3D4T                      3283
#define CLC3GLS3                      3284
#define LC3G4D1N                      3285
#define CLC3GLS3_G4D1N                3286
#define LC3G4D1T                      3287
#define CLC3GLS3_G4D1T                3288
#define LC3G4D2N                      3289
#define CLC3GLS3_G4D2N                3290
#define CLC3GLS3_G4D2T                3291
#define LC3G4D2T                      3292
#define LC3G4D3N                      3293
#define CLC3GLS3_G4D3N                3294
#define CLC3GLS3_G4D3T                3295
#define LC3G4D3T                      3296
#define LC3G4D4N                      3297
#define CLC3GLS3_G4D4N                3298
#define LC3G4D4T                      3299
#define CLC3GLS3_G4D4T                3300
#define CLC4CON                       3301
#define LC4MODE                       3302
#define CLC4CON_MODE                  3303
#define LC4MODE0                      3304
#define CLC4CON_MODE0                 3305
#define LC4MODE1                      3306
#define CLC4CON_MODE1                 3307
#define LC4MODE2                      3308
#define CLC4CON_MODE2                 3309
#define LC4INTN                       3310
#define CLC4CON_INTN                  3311
#define CLC4CON_INTP                  3312
#define LC4INTP                       3313
#define CLC4CON_OUT                   3314
#define LC4OUT                        3315
#define CLC4CON_EN                    3316
#define LC4EN                         3317
#define CLC4POL                       3318
#define CLC4POL_G1POL                 3319
#define LC4G1POL                      3320
#define CLC4POL_G2POL                 3321
#define LC4G2POL                      3322
