tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18855_tdd.h
#define CLC4POL_G3POL                 3323
#define LC4G3POL                      3324
#define LC4G4POL                      3325
#define CLC4POL_G4POL                 3326
#define LC4POL                        3327
#define CLC4POL_POL                   3328
#define CLC4SEL0                      3329
#define LC4D1S0                       3330
#define CLC4SEL0_D1S                  3331
#define CLC4SEL0_D1S0                 3332
#define LC4D1S                        3333
#define LC4D1S1                       3334
#define CLC4SEL0_D1S1                 3335
#define LC4D1S2                       3336
#define CLC4SEL0_D1S2                 3337
#define LC4D1S3                       3338
#define CLC4SEL0_D1S3                 3339
#define LC4D1S4                       3340
#define CLC4SEL0_D1S4                 3341
#define LC4D1S5                       3342
#define CLC4SEL0_D1S5                 3343
#define LC4D1S6                       3344
#define CLC4SEL0_D1S6                 3345
#define LC4D1S7                       3346
#define CLC4SEL0_D1S7                 3347
#define CLC4SEL1                      3348
#define CLC4SEL1_D2S                  3349
#define CLC4SEL1_D2S0                 3350
#define LC4D2S                        3351
#define LC4D2S0                       3352
#define CLC4SEL1_D2S1                 3353
#define LC4D2S1                       3354
#define CLC4SEL1_D2S2                 3355
#define LC4D2S2                       3356
#define CLC4SEL1_D2S3                 3357
#define LC4D2S3                       3358
#define CLC4SEL1_D2S4                 3359
#define LC4D2S4                       3360
#define CLC4SEL1_D2S5                 3361
#define LC4D2S5                       3362
#define CLC4SEL1_D2S6                 3363
#define LC4D2S6                       3364
#define CLC4SEL1_D2S7                 3365
#define LC4D2S7                       3366
#define CLC4SEL2                      3367
#define CLC4SEL2_D3S                  3368
#define LC4D3S0                       3369
#define LC4D3S                        3370
#define CLC4SEL2_D3S0                 3371
#define LC4D3S1                       3372
#define CLC4SEL2_D3S1                 3373
#define LC4D3S2                       3374
#define CLC4SEL2_D3S2                 3375
#define LC4D3S3                       3376
#define CLC4SEL2_D3S3                 3377
#define LC4D3S4                       3378
#define CLC4SEL2_D3S4                 3379
#define LC4D3S5                       3380
#define CLC4SEL2_D3S5                 3381
#define LC4D3S6                       3382
#define CLC4SEL2_D3S6                 3383
#define LC4D3S7                       3384
#define CLC4SEL2_D3S7                 3385
#define CLC4SEL3                      3386
#define CLC4SEL3_D4S                  3387
#define LC4D4S0                       3388
#define CLC4SEL3_D4S0                 3389
#define LC4D4S                        3390
#define LC4D4S1                       3391
#define CLC4SEL3_D4S1                 3392
#define LC4D4S2                       3393
#define CLC4SEL3_D4S2                 3394
#define LC4D4S3                       3395
#define CLC4SEL3_D4S3                 3396
#define LC4D4S4                       3397
#define CLC4SEL3_D4S4                 3398
#define LC4D4S5                       3399
#define CLC4SEL3_D4S5                 3400
#define LC4D4S6                       3401
#define CLC4SEL3_D4S6                 3402
#define LC4D4S7                       3403
#define CLC4SEL3_D4S7                 3404
#define CLC4GLS0                      3405
#define CLC4GLS0_D1N                  3406
#define LC4G1D1N                      3407
#define CLC4GLS0_D1T                  3408
#define LC4G1D1T                      3409
#define CLC4GLS0_D2N                  3410
#define LC4G1D2N                      3411
#define CLC4GLS0_D2T                  3412
#define LC4G1D2T                      3413
#define CLC4GLS0_D3N                  3414
#define LC4G1D3N                      3415
#define CLC4GLS0_D3T                  3416
#define LC4G1D3T                      3417
#define CLC4GLS0_D4N                  3418
#define LC4G1D4N                      3419
#define CLC4GLS0_D4T                  3420
#define LC4G1D4T                      3421
#define CLC4GLS1                      3422
#define CLC4GLS1_D1N                  3423
#define LC4G2D1N                      3424
#define CLC4GLS1_D1T                  3425
#define LC4G2D1T                      3426
#define LC4G2D2N                      3427
#define CLC4GLS1_D2N                  3428
#define LC4G2D2T                      3429
#define CLC4GLS1_D2T                  3430
#define CLC4GLS1_D3N                  3431
#define LC4G2D3N                      3432
#define LC4G2D3T                      3433
#define CLC4GLS1_D3T                  3434
#define CLC4GLS1_D4N                  3435
#define LC4G2D4N                      3436
#define CLC4GLS1_D4T                  3437
#define LC4G2D4T                      3438
#define CLC4GLS2                      3439
#define CLC4GLS2_D1N                  3440
#define LC4G3D1N                      3441
#define CLC4GLS2_D1T                  3442
#define LC4G3D1T                      3443
#define LC4G3D2N                      3444
#define CLC4GLS2_D2N                  3445
#define LC4G3D2T                      3446
#define CLC4GLS2_D2T                  3447
#define CLC4GLS2_D3N                  3448
#define LC4G3D3N                      3449
#define CLC4GLS2_D3T                  3450
#define LC4G3D3T                      3451
#define LC4G3D4N                      3452
#define CLC4GLS2_D4N                  3453
#define LC4G3D4T                      3454
#define CLC4GLS2_D4T                  3455
#define CLC4GLS3                      3456
#define CLC4GLS3_G4D1N                3457
#define LC4G4D1N                      3458
#define LC4G4D1T                      3459
#define CLC4GLS3_G4D1T                3460
#define LC4G4D2N                      3461
#define CLC4GLS3_G4D2N                3462
#define LC4G4D2T                      3463
#define CLC4GLS3_G4D2T                3464
#define CLC4GLS3_G4D3N                3465
#define LC4G4D3N                      3466
#define CLC4GLS3_G4D3T                3467
#define LC4G4D3T                      3468
#define LC4G4D4N                      3469
#define CLC4GLS3_G4D4N                3470
#define LC4G4D4T                      3471
#define CLC4GLS3_G4D4T                3472
#define PPSLOCK                       3473
#define PPSLOCKED                     3474
#define INTPPS0                       3475
#define INTPPS                        3476
#define INTPPS1                       3477
#define INTPPS2                       3478
#define INTPPS3                       3479
#define T0CKIPPS                      3480
#define T0CKIPPS0                     3481
#define T0CKIPPS1                     3482
#define T0CKIPPS2                     3483
#define T0CKIPPS3                     3484
#define T1CKIPPS0                     3485
#define T1CKIPPS                      3486
#define T1CKIPPS1                     3487
#define T1CKIPPS2                     3488
#define T1CKIPPS3                     3489
#define T1CKIPPS4                     3490
#define T1GPPS0                       3491
#define T1GPPS                        3492
#define T1GPPS1                       3493
#define T1GPPS2                       3494
#define T1GPPS3                       3495
#define T1GPPS4                       3496
#define T3CKIPPS0                     3497
#define T3CKIPPS                      3498
#define T3CKIPPS1                     3499
#define T3CKIPPS2                     3500
#define T3CKIPPS3                     3501
#define T3CKIPPS4                     3502
#define T3GPPS0                       3503
#define T3GPPS                        3504
#define T3GPPS1                       3505
#define T3GPPS2                       3506
#define T3GPPS3                       3507
#define T3GPPS4                       3508
#define T5CKIPPS0                     3509
#define T5CKIPPS                      3510
#define T5CKIPPS1                     3511
#define T5CKIPPS2                     3512
#define T5CKIPPS3                     3513
#define T5CKIPPS4                     3514
#define T5GPPS                        3515
#define T5GPPS0                       3516
#define T5GPPS1                       3517
#define T5GPPS2                       3518
#define T5GPPS3                       3519
#define T5GPPS4                       3520
#define T2AINPPS                      3521
#define T2AINPPS0                     3522
#define T2AINPPS1                     3523
#define T2AINPPS2                     3524
#define T2AINPPS3                     3525
#define T2AINPPS4                     3526
#define T4AINPPS                      3527
#define T4AINPPS0                     3528
#define T4AINPPS1                     3529
#define T4AINPPS2                     3530
#define T4AINPPS3                     3531
#define T4AINPPS4                     3532
#define T6AINPPS0                     3533
#define T6AINPPS                      3534
#define T6AINPPS1                     3535
#define T6AINPPS2                     3536
#define T6AINPPS3                     3537
#define T6AINPPS4                     3538
#define CCP1PPS0                      3539
#define CCP1PPS                       3540
#define CCP1PPS1                      3541
#define CCP1PPS2                      3542
#define CCP1PPS3                      3543
#define CCP1PPS4                      3544
#define CCP2PPS0                      3545
#define CCP2PPS                       3546
#define CCP2PPS1                      3547
#define CCP2PPS2                      3548
#define CCP2PPS3                      3549
#define CCP2PPS4                      3550
#define CCP3PPS0                      3551
#define CCP3PPS                       3552
#define CCP3PPS1                      3553
#define CCP3PPS2                      3554
#define CCP3PPS3                      3555
#define CCP3PPS4                      3556
#define CCP4PPS0                      3557
#define CCP4PPS                       3558
#define CCP4PPS1                      3559
#define CCP4PPS2                      3560
#define CCP4PPS3                      3561
#define CCP4PPS4                      3562
#define CCP5PPS                       3563
#define CCP5PPS0                      3564
#define CCP5PPS1                      3565
#define CCP5PPS2                      3566
#define CCP5PPS3                      3567
#define CCP5PPS4                      3568
#define CCP6PPS                       3569
#define SMT1WINPPS                    3570
#define SMU1WINPPS0                   3571
#define SMU1WINPPS1                   3572
#define SMU1WINPPS2                   3573
#define SMU1WINPPS3                   3574
#define SMU1WINPPS4                   3575
#define SMT1SIGPPS                    3576
#define SMU1SIGPPS0                   3577
#define SMU1SIGPPS1                   3578
#define SMU1SIGPPS2                   3579
#define SMU1SIGPPS3                   3580
#define SMU1SIGPPS4                   3581
#define SMT2WINPPS                    3582
#define SMU2WINPPS0                   3583
#define SMU2WINPPS1                   3584
#define SMU2WINPPS2                   3585
#define SMU2WINPPS3                   3586
#define SMU2WINPPS4                   3587
#define SMT2SIGPPS                    3588
#define SMU2SIGPPS0                   3589
#define SMU2SIGPPS1                   3590
#define SMU2SIGPPS2                   3591
#define SMU2SIGPPS3                   3592
#define SMU2SIGPPS4                   3593
#define CWG1PPS0                      3594
#define CWG1PPS                       3595
#define CWG1PPS1                      3596
#define CWG1PPS2                      3597
#define CWG1PPS3                      3598
#define CWG1PPS4                      3599
#define CWG2PPS0                      3600
#define CWG2PPS                       3601
#define CWG2PPS1                      3602
#define CWG2PPS2                      3603
#define CWG2PPS3                      3604
#define CWG2PPS4                      3605
#define CWG3PPS0                      3606
#define CWG3PPS                       3607
#define CWG3PPS1                      3608
#define CWG3PPS2                      3609
#define CWG3PPS3                      3610
#define CWG3PPS4                      3611
#define MDCARLPPS                     3612
#define MDCARLPPS0                    3613
#define MDCARLPPS1                    3614
#define MDCARLPPS2                    3615
#define MDCARLPPS3                    3616
#define MDCARLPPS4                    3617
#define MDCARHPPS0                    3618
#define MDCARHPPS                     3619
#define MDCARHPPS1                    3620
#define MDCARHPPS2                    3621
#define MDCARHPPS3                    3622
#define MDCARHPPS4                    3623
#define MDSRCPPS0                     3624
#define MDSRCPPS                      3625
#define MDSRCPPS1                     3626
#define MDSRCPPS2                     3627
#define MDSRCPPS3                     3628
#define MDSRCPPS4                     3629
#define CLCIN0PPS                     3630
#define CLCIN0PPS0                    3631
#define CLCIN0PPS1                    3632
#define CLCIN0PPS2                    3633
#define CLCIN0PPS3                    3634
#define CLCIN0PPS4                    3635
#define CLCIN1PPS0                    3636
#define CLCIN1PPS                     3637
#define CLCIN1PPS1                    3638
#define CLCIN1PPS2                    3639
#define CLCIN1PPS3                    3640
#define CLCIN1PPS4                    3641
#define CLCIN2PPS                     3642
#define CLCIN2PPS0                    3643
#define CLCIN2PPS1                    3644
#define CLCIN2PPS2                    3645
#define CLCIN2PPS3                    3646
#define CLCIN2PPS4                    3647
#define CLCIN3PPS                     3648
#define CLCIN3PPS0                    3649
#define CLCIN3PPS1                    3650
#define CLCIN3PPS2                    3651
#define CLCIN3PPS3                    3652
#define CLCIN3PPS4                    3653
#define ADCACTPPS                     3654
#define ADCACTPPS0                    3655
#define ADCACTPPS1                    3656
#define ADCACTPPS2                    3657
#define ADCACTPPS3                    3658
#define ADCACTPPS4                    3659
#define SSP1CLKPPS0                   3660
#define SSP1CLKPPS                    3661
#define SSP1CLKPPS1                   3662
#define SSP1CLKPPS2                   3663
#define SSP1CLKPPS3                   3664
#define SSP1CLKPPS4                   3665
#define SSP1DATPPS0                   3666
#define SSP1DATPPS                    3667
#define SSP1DATPPS1                   3668
#define SSP1DATPPS2                   3669
#define SSP1DATPPS3                   3670
#define SSP1DATPPS4                   3671
#define SSP1SSPPS                     3672
#define SSP1SSPPS0                    3673
#define SSP1SSPPS1                    3674
#define SSP1SSPPS2                    3675
#define SSP1SSPPS3                    3676
#define SSP1SSPPS4                    3677
#define SSP2CLKPPS                    3678
#define SSP2CLKPPS0                   3679
#define SSP2CLKPPS1                   3680
#define SSP2CLKPPS2                   3681
#define SSP2CLKPPS3                   3682
#define SSP2CLKPPS4                   3683
#define SSP2DATPPS                    3684
#define SSP2DATPPS0                   3685
#define SSP2DATPPS1                   3686
#define SSP2DATPPS2                   3687
#define SSP2DATPPS3                   3688
#define SSP2DATPPS4                   3689
#define SSP2SSPPS                     3690
#define SSP2SSPPS0                    3691
#define SSP2SSPPS1                    3692
#define SSP2SSPPS2                    3693
#define SSP2SSPPS3                    3694
#define SSP2SSPPS4                    3695
#define RXPPS                         3696
#define RXPPS0                        3697
#define RXPPS1                        3698
#define RXPPS2                        3699
#define RXPPS3                        3700
#define RXPPS4                        3701
#define TXPPS0                        3702
#define TXPPS                         3703
#define TXPPS1                        3704
#define TXPPS2                        3705
#define TXPPS3                        3706
#define TXPPS4                        3707
#define RA0PPS                        3708
#define RA0PPS0                       3709
#define RA0PPS1                       3710
#define RA0PPS2                       3711
#define RA0PPS3                       3712
#define RA0PPS4                       3713
#define RA0PPS5                       3714
#define RA1PPS                        3715
#define RA1PPS0                       3716
#define RA1PPS1                       3717
#define RA1PPS2                       3718
#define RA1PPS3                       3719
#define RA1PPS4                       3720
#define RA1PPS5                       3721
#define RA2PPS                        3722
#define RA2PPS0                       3723
#define RA2PPS1                       3724
#define RA2PPS2                       3725
#define RA2PPS3                       3726
#define RA2PPS4                       3727
#define RA2PPS5                       3728
#define RA3PPS                        3729
#define RA3PPS0                       3730
#define RA3PPS1                       3731
#define RA3PPS2                       3732
#define RA3PPS3                       3733
#define RA3PPS4                       3734
#define RA3PPS5                       3735
#define RA4PPS                        3736
#define RA4PPS0                       3737
#define RA4PPS1                       3738
#define RA4PPS2                       3739
#define RA4PPS3                       3740
#define RA4PPS4                       3741
#define RA4PPS5                       3742
#define RA5PPS                        3743
#define RA5PPS0                       3744
#define RA5PPS1                       3745
#define RA5PPS2                       3746
#define RA5PPS3                       3747
#define RA5PPS4                       3748
#define RA5PPS5                       3749
#define RA6PPS                        3750
#define RA6PPS0                       3751
#define RA6PPS1                       3752
#define RA6PPS2                       3753
#define RA6PPS3                       3754
#define RA6PPS4                       3755
#define RA6PPS5                       3756
#define RA7PPS                        3757
#define RA7PPS0                       3758
#define RA7PPS1                       3759
#define RA7PPS2                       3760
#define RA7PPS3                       3761
#define RA7PPS4                       3762
#define RA7PPS5                       3763
#define RB0PPS                        3764
#define RB0PPS0                       3765
#define RB0PPS1                       3766
#define RB0PPS2                       3767
#define RB0PPS3                       3768
#define RB0PPS4                       3769
#define RB0PPS5                       3770
#define RB1PPS                        3771
#define RB1PPS0                       3772
#define RB1PPS1                       3773
#define RB1PPS2                       3774
#define RB1PPS3                       3775
#define RB1PPS4                       3776
#define RB1PPS5                       3777
#define RB2PPS                        3778
#define RB2PPS0                       3779
#define RB2PPS1                       3780
#define RB2PPS2                       3781
#define RB2PPS3                       3782
#define RB2PPS4                       3783
#define RB2PPS5                       3784
#define RB3PPS                        3785
#define RB3PPS0                       3786
#define RB3PPS1                       3787
#define RB3PPS2                       3788
#define RB3PPS3                       3789
#define RB3PPS4                       3790
#define RB3PPS5                       3791
#define RB4PPS                        3792
#define RB4PPS0                       3793
#define RB4PPS1                       3794
#define RB4PPS2                       3795
#define RB4PPS3                       3796
#define RB4PPS4                       3797
#define RB4PPS5                       3798
#define RB5PPS                        3799
#define RB5PPS0                       3800
#define RB5PPS1                       3801
#define RB5PPS2                       3802
#define RB5PPS3                       3803
#define RB5PPS4                       3804
#define RB5PPS5                       3805
#define RB6PPS                        3806
#define RB6PPS0                       3807
#define RB6PPS1                       3808
#define RB6PPS2                       3809
#define RB6PPS3                       3810
#define RB6PPS4                       3811
#define RB6PPS5                       3812
#define RB7PPS                        3813
#define RB7PPS0                       3814
#define RB7PPS1                       3815
#define RB7PPS2                       3816
#define RB7PPS3                       3817
#define RB7PPS4                       3818
#define RB7PPS5                       3819
#define RC0PPS                        3820
#define RC0PPS0                       3821
#define RC0PPS1                       3822
#define RC0PPS2                       3823
#define RC0PPS3                       3824
#define RC0PPS4                       3825
#define RC0PPS5                       3826
#define RC1PPS                        3827
#define RC1PPS0                       3828
#define RC1PPS1                       3829
#define RC1PPS2                       3830
#define RC1PPS3                       3831
#define RC1PPS4                       3832
#define RC1PPS5                       3833
#define RC2PPS                        3834
#define RC2PPS0                       3835
#define RC2PPS1                       3836
#define RC2PPS2                       3837
#define RC2PPS3                       3838
#define RC2PPS4                       3839
#define RC2PPS5                       3840
#define RC3PPS                        3841
#define RC3PPS0                       3842
#define RC3PPS1                       3843
#define RC3PPS2                       3844
#define RC3PPS3                       3845
#define RC3PPS4                       3846
#define RC3PPS5                       3847
#define RC4PPS                        3848
#define RC4PPS0                       3849
#define RC4PPS1                       3850
#define RC4PPS2                       3851
#define RC4PPS3                       3852
#define RC4PPS4                       3853
#define RC4PPS5                       3854
#define RC5PPS                        3855
#define RC5PPS0                       3856
#define RC5PPS1                       3857
#define RC5PPS2                       3858
#define RC5PPS3                       3859
#define RC5PPS4                       3860
#define RC5PPS5                       3861
#define RC6PPS                        3862
#define RC6PPS0                       3863
#define RC6PPS1                       3864
#define RC6PPS2                       3865
#define RC6PPS3                       3866
#define RC6PPS4                       3867
#define RC6PPS5                       3868
#define RC7PPS                        3869
#define RC7PPS0                       3870
#define RC7PPS1                       3871
#define RC7PPS2                       3872
#define RC7PPS3                       3873
#define RC7PPS4                       3874
#define RC7PPS5                       3875
#define ANSELA                        3876
#define ANSA0                         3877
#define ANSA1                         3878
#define ANSA2                         3879
#define ANSA3                         3880
