tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18855_tdd.h
#define ANSA4                         3881
#define ANSA5                         3882
#define ANSA6                         3883
#define ANSA7                         3884
#define WPUA                          3885
#define WPUA0                         3886
#define WPUA1                         3887
#define WPUA2                         3888
#define WPUA3                         3889
#define WPUA4                         3890
#define WPUA5                         3891
#define WPUA6                         3892
#define WPUA7                         3893
#define ODCONA                        3894
#define ODCA0                         3895
#define ODCA1                         3896
#define ODCA2                         3897
#define ODCA3                         3898
#define ODCA4                         3899
#define ODCA5                         3900
#define ODCA6                         3901
#define ODCA7                         3902
#define SLRCONA                       3903
#define SLRA0                         3904
#define SLRA1                         3905
#define SLRA2                         3906
#define SLRA3                         3907
#define SLRA4                         3908
#define SLRA5                         3909
#define SLRA6                         3910
#define SLRA7                         3911
#define INLVLA                        3912
#define INLVLA0                       3913
#define INLVLA1                       3914
#define INLVLA2                       3915
#define INLVLA3                       3916
#define INLVLA4                       3917
#define INLVLA5                       3918
#define INLVLA6                       3919
#define INLVLA7                       3920
#define IOCAP                         3921
#define IOCAP0                        3922
#define IOCAP1                        3923
#define IOCAP2                        3924
#define IOCAP3                        3925
#define IOCAP4                        3926
#define IOCAP5                        3927
#define IOCAP6                        3928
#define IOCAP7                        3929
#define IOCAN                         3930
#define IOCAN0                        3931
#define IOCAN1                        3932
#define IOCAN2                        3933
#define IOCAN3                        3934
#define IOCAN4                        3935
#define IOCAN5                        3936
#define IOCAN6                        3937
#define IOCAN7                        3938
#define IOCAF                         3939
#define IOCAF0                        3940
#define IOCAF1                        3941
#define IOCAF2                        3942
#define IOCAF3                        3943
#define IOCAF4                        3944
#define IOCAF5                        3945
#define IOCAF6                        3946
#define IOCAF7                        3947
#define CCDNA                         3948
#define CCDNA0                        3949
#define CCDNA1                        3950
#define CCDNA2                        3951
#define CCDNA3                        3952
#define CCDNA4                        3953
#define CCDNA5                        3954
#define CCDNA6                        3955
#define CCDNA7                        3956
#define CCDPA                         3957
#define CCDPA0                        3958
#define CCDPA1                        3959
#define CCDPA2                        3960
#define CCDPA3                        3961
#define CCDPA4                        3962
#define CCDPA5                        3963
#define CCDPA6                        3964
#define CCDPA7                        3965
#define ANSELB                        3966
#define ANSB0                         3967
#define ANSB1                         3968
#define ANSB2                         3969
#define ANSB3                         3970
#define ANSB4                         3971
#define ANSB5                         3972
#define ANSB6                         3973
#define ANSB7                         3974
#define WPUB                          3975
#define WPUB0                         3976
#define WPUB1                         3977
#define WPUB2                         3978
#define WPUB3                         3979
#define WPUB4                         3980
#define WPUB5                         3981
#define WPUB6                         3982
#define WPUB7                         3983
#define ODCONB                        3984
#define ODCB0                         3985
#define ODCB1                         3986
#define ODCB2                         3987
#define ODCB3                         3988
#define ODCB4                         3989
#define ODCB5                         3990
#define ODCB6                         3991
#define ODCB7                         3992
#define SLRCONB                       3993
#define SLRB0                         3994
#define SLRB1                         3995
#define SLRB2                         3996
#define SLRB3                         3997
#define SLRB4                         3998
#define SLRB5                         3999
#define SLRB6                         4000
#define SLRB7                         4001
#define INLVLB                        4002
#define INLVLB0                       4003
#define INLVLB1                       4004
#define INLVLB2                       4005
#define INLVLB3                       4006
#define INLVLB4                       4007
#define INLVLB5                       4008
#define INLVLB6                       4009
#define INLVLB7                       4010
#define IOCBP                         4011
#define IOCBP0                        4012
#define IOCBP1                        4013
#define IOCBP2                        4014
#define IOCBP3                        4015
#define IOCBP4                        4016
#define IOCBP5                        4017
#define IOCBP6                        4018
#define IOCBP7                        4019
#define IOCBN                         4020
#define IOCBN0                        4021
#define IOCBN1                        4022
#define IOCBN2                        4023
#define IOCBN3                        4024
#define IOCBN4                        4025
#define IOCBN5                        4026
#define IOCBN6                        4027
#define IOCBN7                        4028
#define IOCBF                         4029
#define IOCBF0                        4030
#define IOCBF1                        4031
#define IOCBF2                        4032
#define IOCBF3                        4033
#define IOCBF4                        4034
#define IOCBF5                        4035
#define IOCBF6                        4036
#define IOCBF7                        4037
#define CCDNB                         4038
#define CCDNB0                        4039
#define CCDNB1                        4040
#define CCDNB2                        4041
#define CCDNB3                        4042
#define CCDNB4                        4043
#define CCDNB5                        4044
#define CCDNB6                        4045
#define CCDNB7                        4046
#define CCDPB                         4047
#define CCDPB0                        4048
#define CCDPB1                        4049
#define CCDPB2                        4050
#define CCDPB3                        4051
#define CCDPB4                        4052
#define CCDPB5                        4053
#define CCDPB6                        4054
#define CCDPB7                        4055
#define ANSELC                        4056
#define ANSC0                         4057
#define ANSC1                         4058
#define ANSC2                         4059
#define ANSC3                         4060
#define ANSC4                         4061
#define ANSC5                         4062
#define ANSC6                         4063
#define ANSC7                         4064
#define WPUC                          4065
#define WPUC0                         4066
#define WPUC1                         4067
#define WPUC2                         4068
#define WPUC3                         4069
#define WPUC4                         4070
#define WPUC5                         4071
#define WPUC6                         4072
#define WPUC7                         4073
#define ODCONC                        4074
#define ODCC0                         4075
#define ODCC1                         4076
#define ODCC2                         4077
#define ODCC3                         4078
#define ODCC4                         4079
#define ODCC5                         4080
#define ODCC6                         4081
#define ODCC7                         4082
#define SLRCONC                       4083
#define SLRC0                         4084
#define SLRC1                         4085
#define SLRC2                         4086
#define SLRC3                         4087
#define SLRC4                         4088
#define SLRC5                         4089
#define SLRC6                         4090
#define SLRC7                         4091
#define INLVLC                        4092
#define INLVLC0                       4093
#define INLVLC1                       4094
#define INLVLC2                       4095
#define INLVLC3                       4096
#define INLVLC4                       4097
#define INLVLC5                       4098
#define INLVLC6                       4099
#define INLVLC7                       4100
#define IOCCP                         4101
#define IOCCP0                        4102
#define IOCCP1                        4103
#define IOCCP2                        4104
#define IOCCP3                        4105
#define IOCCP4                        4106
#define IOCCP5                        4107
#define IOCCP6                        4108
#define IOCCP7                        4109
#define IOCCN                         4110
#define IOCCN0                        4111
#define IOCCN1                        4112
#define IOCCN2                        4113
#define IOCCN3                        4114
#define IOCCN4                        4115
#define IOCCN5                        4116
#define IOCCN6                        4117
#define IOCCN7                        4118
#define IOCCF                         4119
#define IOCCF0                        4120
#define IOCCF1                        4121
#define IOCCF2                        4122
#define IOCCF3                        4123
#define IOCCF4                        4124
#define IOCCF5                        4125
#define IOCCF6                        4126
#define IOCCF7                        4127
#define CCDNC                         4128
#define CCDNC0                        4129
#define CCDNC1                        4130
#define CCDNC2                        4131
#define CCDNC3                        4132
#define CCDNC4                        4133
#define CCDNC5                        4134
#define CCDNC6                        4135
#define CCDNC7                        4136
#define CCDPC                         4137
#define CCDPC0                        4138
#define CCDPC1                        4139
#define CCDPC2                        4140
#define CCDPC3                        4141
#define CCDPC4                        4142
#define CCDPC5                        4143
#define CCDPC6                        4144
#define CCDPC7                        4145
#define WPUE                          4146
#define WPUE3                         4147
#define INLVLE                        4148
#define INLVLE3                       4149
#define IOCEP                         4150
#define IOCEP3                        4151
#define IOCEN                         4152
#define IOCEN3                        4153
#define IOCEF                         4154
#define IOCEF3                        4155
#define STATUS_SHAD                   4156
#define C_SHAD                        4157
#define DC_SHAD                       4158
#define Z_SHAD                        4159
#define WREG_SHAD                     4160
#define BSR_SHAD                      4161
#define PCLATH_SHAD                   4162
#define FSR0L_SHAD                    4163
#define FSR0H_SHAD                    4164
#define FSR1L_SHAD                    4165
#define FSR1H_SHAD                    4166
#define STKPTR                        4167
#define TOSL                          4168
#define TOSH                          4169

#endif // _PIC16LF18855_H_
